package SportProgr;

public class Tin_osen_22_D {
    /* Обработать файл, содержащий строки трех типов:
    { начало блока
    } конец блока
    var = <val> присваивание в переменную с именем var значения val
    Val может быть двух типов: число , по модулю не более 10 в 9  или  название переменной,
    чье значение нужно присвоить
    В файле нет пробелов и каждая операция записана с новой строки. Изначально все перменные
    равны 0. Как только встречается присваивание, оно выполняется и значение сохраняется до
    конца блока (если не перезаписано), и после конца блока возвращается старое значение.
    Вывeсти значение переменной var1 после каждого присваивания вида var1 = var2.

    thats = zero                     0
    a = 10
    ten = a                          10
    aboba = ten                      10
    ten = -10
    {
    b = a                             10
    a = 1337
    c = a                            1337
    {
    d = a                            1337
    e = aboba                        10
    }
    }
    lol = a                         10
     */
}
